import 'package:flutter/material.dart'; // Імпорт основної бібліотеки віджетів Flutter (для використання класу Color)

// Визначення класу Category - моделі даних для категорії страви
class Category {
  // Конструктор класу Category. Позначається як const, що дозволяє створювати константні екземпляри цього класу.
  const Category({
    required this.id, // Обов'язковий параметр: унікальний ідентифікатор категорії
    required this.title, // Обов'язковий параметр: назва категорії
    this.color =
        Colors
            .orange, // Необов'язковий параметр: колір категорії, за замовчуванням - оранжевий
  });

  final String id; // Властивість для зберігання ідентифікатора категорії
  final String title; // Властивість для зберігання назви категорії
  final Color
  color; // Властивість для зберігання кольору, пов'язаного з категорією
}
